[{"label": "good", "published": "Tue, 05 Sep 2017 11:10:33 GMT", "url": "http://www.newswire.ca/news-releases/neovascs-reducer-system-reviewed-in-european-heart-journal-642730973.html", "title": "  Neovasc's Reducer System Reviewed in European Heart Journal", "body": "Cision Communications Cloud MediaSource Monitoring/Evaluation My CNWCNW AccessRegister for my CNW CNW AccessRegister for my CNW Review serves to update clinicians as to current evidence and future perspectives on the optimal utilization of this innovative technologyNASDAQ, TSX: NVCNVANCOUVER, Sept. 5, 2017 /CNW/ - Neovasc Inc. (\"Neovasc\" or the \"Company\") (NASDAQ, TSX: NVCN) today announced the European Heart Journal published a clinical review of its Neovasc Reducer™ (\"Reducer\") device for the treatment of refractory/persistent angina pectoris, a common and disabling medical condition, and a major public health problem that affects millions of patients worldwide.  The European Heart Journal is the official general cardiology journal of the European Society of Cardiology.Refractory angina is a common and disabling clinical condition, and a major public health problem, which affects patients' quality of life, and has a significant impact upon health care resources.  Persistent angina is common not only in patients who are not good candidates for revascularization, but also in patients following successful revascularization. \"Angina often persists following revascularization.  The prevalence of this 'persistent' angina is as high as 25% after 1 year, and up to 45% after 3 years following revascularization,\" reported Dr. Maayan Konigstein, Department of Cardiology, Tel-Aviv Medical Center. The coronary sinus Reducer is a novel technology designed to reduce disabling symptoms and improve quality of life of patients suffering from refractory angina.  This clinical review serves to update the clinician as to current evidence and future perspectives of the optimal utilization of this innovative technology.\"At present, accumulating evidence supports the clinical benefit of the Reducer in significantly alleviating symptoms of angina in 70-80% of patients with obstructive Coronary Artery Disease who are not candidates for revascularization,\" commented Alexei Marko, CEO of Neovasc. \"This type of dramatic results, along with a simple, safe and straightforward procedure, are underpinning Reducer's commercial success in Europe. With more than 500 cases performed to date, Reducer's impact in alleviating pain and improving quality of life continues to draw the attention of the medical community.\"About the Neovasc Reducer™The Reducer is CE-marked in the European Union for the treatment of refractory angina, a painful and debilitating condition that occurs when the coronary arteries deliver an inadequate supply of blood to the heart muscle, despite treatment with standard revascularization or cardiac drug therapies. It affects millions of patients worldwide, who typically lead severely restricted lives as a result of their disabling symptoms, and its incidence is growing. The Reducer provides relief of angina symptoms by altering blood flow in the heart's circulatory system, thereby increasing the perfusion of oxygenated blood to ischemic areas of the heart muscle.  Placement of the Reducer is performed using a minimally invasive transvenous procedure that is similar to implanting a coronary stent and is completed in approximately 20 minutes.  About Neovasc Inc. Neovasc is a specialty medical device company that develops, manufactures and markets products for the rapidly growing cardiovascular marketplace.  Its products include the Neovasc Reducer™, for the treatment of refractory angina which is not currently available in the United States and has been available in Europe since 2015 and the Tiara™, for the transcatheter treatment of mitral valve disease, which is currently under investigation in the United States, Canada and Europe. The Company also sells a line of advanced biological tissue products that are used as key components in third-party medical products including transcatheter heart valves. For more information, visit: www.neovasc.com.This news release contains forward-looking statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws regarding the Company's plans and expectations concerning its business, trends and other matters, including the Company's expectations relating to the number of patients that will not be candidates for conventional surgery, and the Company's commercial success in Europe.  Words and phrases such as \"growing\", \"begun\", \"continues\" and \"anticipated\", and similar words or expressions, are intended to identify these forward-looking statements.  Forward-looking statements are based on estimates and assumptions made by the Company in light of its experience and its perception of historical trends, current conditions and expected future developments, as well as other factors that the Company believes are appropriate in the circumstances.  Many factors and assumptions could cause the Company's actual results, performance or achievements to differ materially from those expressed or implied by the forward-looking statements, including, without limitation, risks relating to the Company's litigation with CardiAQ, including the Company's ability to successfully appeal the validity of the awards as well as the ruling on inventorship, which create material uncertainty and which cast substantial doubt on the Company's ability to continue as a going concern; the substantial doubt about the Company's ability to continue as a going concern; risks relating to the Company's need for significant additional future capital and the Company's ability to raise additional funding; risks relating to claims by third parties alleging infringement of their intellectual property rights; the Company's ability to establish, maintain and defend intellectual property rights in its products; risks relating to results from clinical trials of the Company's products, which may be unfavorable or perceived as unfavorable; the Company's history of losses and significant accumulated deficit; risks associated with product liability claims, insurance and recalls; risks relating to competition in the medical device industry, including the risk that one or more competitors may develop more effective or more affordable products; risks relating to the Company's ability to achieve or maintain expected levels of market acceptance for its products, as well as the Company's ability to successfully build its in-house sales capabilities or secure third-party marketing or distribution partners; the Company's ability to convince public payors and hospitals to include the Company's products on their approved products lists; risks relating to new legislation, new regulatory requirements and the efforts of governmental and third party payors to contain or reduce the costs of healthcare; risks relating to increased regulation, enforcement and inspections of participants in the medical device industry, including frequent government investigations into marketing and other business practices; risks associated with the extensive regulation of the Company's products and trials by governmental authorities, as well as the cost and time delays associated therewith; risks associated with post-market regulation of the Company's products; health and safety risks associated with the Company's products and industry; risks associated with the Company's manufacturing operations, including the regulation of the Company's manufacturing processes by governmental authorities and the availability of two critical components of the Reducer; risk of animal disease associated with the use of the Company's products; risks relating to the manufacturing capacity of third-party manufacturers for the Company's products, including risks of supply interruptions impacting the Company's ability to manufacture its own products; risks relating to breaches of anti-bribery laws by the Company's employees or agents; risks associated with future changes in financial accounting standards and new accounting pronouncements; the Company's dependence upon key personnel to achieve its business objectives; the Company's ability to maintain strong relationships with physicians; risks relating to the sufficiency of the Company's management systems and resources in periods of significant growth; risks associated with consolidation in the health care industry, including the downward pressure on product pricing and the growing need to be selected by larger customers in order to make sales to their members or participants; the Company's ability to successfully identify and complete corporate transactions on favorable terms or achieve anticipated synergies relating to any acquisitions or alliances; anti-takeover provisions in the Company's constating documents which could discourage a third party from making a takeover bid beneficial to the Company's shareholders; risks relating to conflicts of interests among the Company's officers and directors as a result of their involvement with other issuers; and risks relating to the influence of significant shareholders of the Company over the Company's business operations and share price.  These risk factors and others relating to the Company are discussed in greater detail in the \"Risk Factors\" section of the Company's Annual Information Form and in the Company's Management's Discussion and Analysis of Financial Condition and Results of Operations, each of which are included in the Company's Annual Report on Form 40-F (copies of which filings may be obtained at www.sedar.com or www.sec.gov).  These factors should be considered carefully, and readers should not place undue reliance on the Company's forward-looking statements.  The Company has no intention and undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.SOURCE Neovasc Inc.     Review serves to update clinicians as to current evidence and future perspectives on the optimal utilization of this innovative technology VANCOUVER, Sept. 5, 2017 /CNW/ - Neovasc Inc. (\"Neovasc\" or the \"Company\") (NASDAQ, TSX: NVCN) today announced the European Heart Journal published a clinical review of its Neovasc Reducer™ (\"Reducer\") device for the treatment of refractory/persistent angina pectoris, a common and disabling medical condition, and a major public health problem that affects millions of patients worldwide.  The European Heart Journal is the official general cardiology journal of the European Society of Cardiology. Refractory angina is a common and disabling clinical condition, and a major public health problem, which affects patients' quality of life, and has a significant impact upon health care resources.  Persistent angina is common not only in patients who are not good candidates for revascularization, but also in patients following successful revascularization.  \"Angina often persists following revascularization.  The prevalence of this 'persistent' angina is as high as 25% after 1 year, and up to 45% after 3 years following revascularization,\" reported Dr. Maayan Konigstein, Department of Cardiology, Tel-Aviv Medical Center.  The coronary sinus Reducer is a novel technology designed to reduce disabling symptoms and improve quality of life of patients suffering from refractory angina.  This clinical review serves to update the clinician as to current evidence and future perspectives of the optimal utilization of this innovative technology. \"At present, accumulating evidence supports the clinical benefit of the Reducer in significantly alleviating symptoms of angina in 70-80% of patients with obstructive Coronary Artery Disease who are not candidates for revascularization,\" commented Alexei Marko, CEO of Neovasc. \"This type of dramatic results, along with a simple, safe and straightforward procedure, are underpinning Reducer's commercial success in Europe. With more than 500 cases performed to date, Reducer's impact in alleviating pain and improving quality of life continues to draw the attention of the medical community.\" About the Neovasc Reducer™The Reducer is CE-marked in the European Union for the treatment of refractory angina, a painful and debilitating condition that occurs when the coronary arteries deliver an inadequate supply of blood to the heart muscle, despite treatment with standard revascularization or cardiac drug therapies. It affects millions of patients worldwide, who typically lead severely restricted lives as a result of their disabling symptoms, and its incidence is growing. The Reducer provides relief of angina symptoms by altering blood flow in the heart's circulatory system, thereby increasing the perfusion of oxygenated blood to ischemic areas of the heart muscle.  Placement of the Reducer is performed using a minimally invasive transvenous procedure that is similar to implanting a coronary stent and is completed in approximately 20 minutes.   About Neovasc Inc. Neovasc is a specialty medical device company that develops, manufactures and markets products for the rapidly growing cardiovascular marketplace.  Its products include the Neovasc Reducer™, for the treatment of refractory angina which is not currently available in the United States and has been available in Europe since 2015 and the Tiara™, for the transcatheter treatment of mitral valve disease, which is currently under investigation in the United States, Canada and Europe. The Company also sells a line of advanced biological tissue products that are used as key components in third-party medical products including transcatheter heart valves. For more information, visit: www.neovasc.com. This news release contains forward-looking statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws regarding the Company's plans and expectations concerning its business, trends and other matters, including the Company's expectations relating to the number of patients that will not be candidates for conventional surgery, and the Company's commercial success in Europe.  Words and phrases such as \"growing\", \"begun\", \"continues\" and \"anticipated\", and similar words or expressions, are intended to identify these forward-looking statements.  Forward-looking statements are based on estimates and assumptions made by the Company in light of its experience and its perception of historical trends, current conditions and expected future developments, as well as other factors that the Company believes are appropriate in the circumstances.  Many factors and assumptions could cause the Company's actual results, performance or achievements to differ materially from those expressed or implied by the forward-looking statements, including, without limitation, risks relating to the Company's litigation with CardiAQ, including the Company's ability to successfully appeal the validity of the awards as well as the ruling on inventorship, which create material uncertainty and which cast substantial doubt on the Company's ability to continue as a going concern; the substantial doubt about the Company's ability to continue as a going concern; risks relating to the Company's need for significant additional future capital and the Company's ability to raise additional funding; risks relating to claims by third parties alleging infringement of their intellectual property rights; the Company's ability to establish, maintain and defend intellectual property rights in its products; risks relating to results from clinical trials of the Company's products, which may be unfavorable or perceived as unfavorable; the Company's history of losses and significant accumulated deficit; risks associated with product liability claims, insurance and recalls; risks relating to competition in the medical device industry, including the risk that one or more competitors may develop more effective or more affordable products; risks relating to the Company's ability to achieve or maintain expected levels of market acceptance for its products, as well as the Company's ability to successfully build its in-house sales capabilities or secure third-party marketing or distribution partners; the Company's ability to convince public payors and hospitals to include the Company's products on their approved products lists; risks relating to new legislation, new regulatory requirements and the efforts of governmental and third party payors to contain or reduce the costs of healthcare; risks relating to increased regulation, enforcement and inspections of participants in the medical device industry, including frequent government investigations into marketing and other business practices; risks associated with the extensive regulation of the Company's products and trials by governmental authorities, as well as the cost and time delays associated therewith; risks associated with post-market regulation of the Company's products; health and safety risks associated with the Company's products and industry; risks associated with the Company's manufacturing operations, including the regulation of the Company's manufacturing processes by governmental authorities and the availability of two critical components of the Reducer; risk of animal disease associated with the use of the Company's products; risks relating to the manufacturing capacity of third-party manufacturers for the Company's products, including risks of supply interruptions impacting the Company's ability to manufacture its own products; risks relating to breaches of anti-bribery laws by the Company's employees or agents; risks associated with future changes in financial accounting standards and new accounting pronouncements; the Company's dependence upon key personnel to achieve its business objectives; the Company's ability to maintain strong relationships with physicians; risks relating to the sufficiency of the Company's management systems and resources in periods of significant growth; risks associated with consolidation in the health care industry, including the downward pressure on product pricing and the growing need to be selected by larger customers in order to make sales to their members or participants; the Company's ability to successfully identify and complete corporate transactions on favorable terms or achieve anticipated synergies relating to any acquisitions or alliances; anti-takeover provisions in the Company's constating documents which could discourage a third party from making a takeover bid beneficial to the Company's shareholders; risks relating to conflicts of interests among the Company's officers and directors as a result of their involvement with other issuers; and risks relating to the influence of significant shareholders of the Company over the Company's business operations and share price.  These risk factors and others relating to the Company are discussed in greater detail in the \"Risk Factors\" section of the Company's Annual Information Form and in the Company's Management's Discussion and Analysis of Financial Condition and Results of Operations, each of which are included in the Company's Annual Report on Form 40-F (copies of which filings may be obtained at www.sedar.com or www.sec.gov).  These factors should be considered carefully, and readers should not place undue reliance on the Company's forward-looking statements.  The Company has no intention and undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. SOURCE Neovasc Inc.     For further information:  Investor Relations: Neovasc Inc., Chris Clark, 604 248-4138, cclark@neovasc.com  More on this organization Browse our custom packages or build your own to meet your unique communications needs. Fill out a CNW membership form or contact us at 1 (877) 269-7890 Request more information about CNW products and services or call us at 1 (877) 269-7890  © 2017 CNW Group Ltd."}, {"label": "good", "published": "Fri, 01 Sep 2017 21:00:56 GMT", "url": "http://www.massdevice.com/neovasc-shares-surge-45-affirmed-tiara-patent-case-decision-edwards/", "title": "NeoVasc shares surge 45% on affirmed Tiara patent case decision against Edwards – MassDevice", "body": "The Medical Device Business Journal — Medical Device News & Articles | MassDevice September 1, 2017 By Fink Densford Leave a Comment  UPDATE: Updated to include comment from Edwards Lifesciences Neovasc (NSDQ:NVCN) saw its shares jump 45% today after a federal appeals court upheld a district court ruling in a trade secret spat with Edwards Lifesciences (NYSE:EW) subsidiary CardiAQ Valve, affirming a decision not to enjoin its Tiara program. With the decision, Neovasc will be required to pay the full judgement of approximately $112 million to Edwards, of which the company said $70 million is already held in an escrow account. The Vancouver-based company said that “there are no other monetary damages arising from the award,” and announced that it will remain the joint inventor of its ‘964 patent related to its Tiara transcatheter mitral valve replacement device. Neovasc will share the patent along with 2 employees of CardiAQ Valve, with both parties “having freedom to use the patent without an obligation to pay royalties to the other, according to a press release. Shares in Neovasc, which had been halted from trading earlier by NASDAQ awaiting the decision, surged up to as much as 67% in response, settling at 45% up to close at $1.15. Neovasc said it is considering whether to pursue further appellate review of the decision. A spokesperson from Edwards told MassDevice.com that the company was pleased with the court decision. “We are pleased with the federal circuit’s decision, which upholds and recognizes the foundational work of CardiAQ on a transcatheter mitral valve replacement to help patients who aren’t well served by currently available therapies today,” Edwards wrote in an email. A jury last May awarded $70 million to CardiAQ after finding that Neovasc misappropriated trade secrets in developing its Tiara transcatheter mitral valve replacement device. Edwards inherited the lawsuit when it acquired CardiAQ Valve for $400 million in August 2014. A federal judge in Massachusetts added $21 million in enhanced damages to the decision last November. CardiAQ asked Judge Allison Burroughs of the U.S. District Court for Massachusetts to also award pre- and post-judgment interest. In January, Burroughs obliged, tacking on $20.7 million in pre-judgment interest and $2354.27 per day in post-judgment interest from Nov. 16, 2016, “until judgment is satisfied,” according to court documents. Filed Under: Cardiovascular, Legal News, Replacement Heart Valves Tagged With: Neovasc Inc. You must be logged in to post a comment. Copyright © 2017 · WTWH Media LLC and its licensors. All rights reserved.  The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of WTWH Media. Advertise |  Privacy Policy "}, {"label": "good", "published": "Tue, 05 Sep 2017 15:06:30 GMT", "url": "http://www.lifesciencesipreview.com/news/federal-circuit-has-denied-request-by-cardiaq-to-take-out-an-injunction-on-neovasc-2383", "title": "Federal Circuit denies CardiAQ injunction request against Neovasc", "body": "This website uses cookies to improve your experience. Continue if you are OK with this or read more in our privacy policy.  BCFC / iStockphoto.com BCFC / iStockphoto.com The US Court of Appeals for the Federal Circuit has affirmed a district court decision which stated that CardiAQ is not entitled to injunctive relief, despite a $91 million damages payout from Neovasc. The US District Court for the District of Massachusetts had earlier ruled that medical devices company CardiAQ was entitled to damages following trade secrets misappropriation by rival company Neovasc.   In a decision handed down on Friday, September 1, the court stated that CardiAQ’s request for an injunction that would suspend Neovasc from a project on transcatheter mitral valve implants (TMVI) project for 18 months was denied.    The TMVI originally developed by CardiAQ can be delivered to the heart by a catheter rather than open-heart surgery. CardiAQ engaged Neovasc to help construct a part of the device. The joint work ended after about one year, but during that year, Neovasc secretly launched its own TMVI project and secured a patent on it, US number 8,579,964, without acknowledging anyone from CardiAQ as co-inventors. The court said on the matter: “The proposed 18-month suspension would be duplicative of the monetary relief, and is not warranted given the uncertainty in the TMVI market, the impact the injunction would have on Neovasc, and the public’s interest in having access to a potentially life-saving technology.” But the court also stated that CaridAQ had legitimate grievances for suing Neovasc, as it had misappropriated several of CardiAQ’s trade secrets. While Neovasc worked alongside CardiAQ, according to the court, the principal Neovasc employee in the collaboration, Randy Lane, used information shared by CardiAQ to develop a TMVI for Neovasc. In particular, CardiAQ felt that both founders of the company, cardiac surgeon Arshad Quadri and engineer Brent Ratz, should have been named as co-creators on the ‘964 patent. CardiAQ was formed in 2006 by Quadri and Ratz with the aim of developing a prosthetic mitral heart valve that could be implanted via a catheter entering the body through a small incision in the patient’s leg, making open-heart surgery redundant. The TMVI itself is made up of a metal frame to which valve leaflets made from animal tissue are sewn. In June 2009 Neovasc contacted CardiAQ to advertise its pericardial tissue products and services. This led to CardiAQ and Neovasc working together on the TMVI. Did you enjoy reading this story? Sign up to our free newsletters and get stories like this sent straight to your inbox. US Court of Appeals for the Federal Circuit, District Court of Massachusetts, CardiAQ, Neovasc, Arshad Quadri, Brent Ratz, medical devices Federal Circuit affirms district court’s Bayer ruling02-03-2017 Newton Media LtdKingfisher House21-23 Elmfield RoadBromleyBR1 1LTUnited Kingdom"}, {"label": "good", "published": "Thu, 10 Aug 2017 23:41:23 GMT", "url": "https://seekingalpha.com/article/4097747-neovascs-nvcn-ceo-alexei-marko-q2-2017-results-earnings-call-transcript", "title": "Neovasc's (NVCN) CEO Alexei Marko on Q2 2017 Results - Earnings Call Transcript | Seeking Alpha", "body": "Neovasc Inc. (NASDAQ:NVCN) Q2 2017 Results Earnings Conference Call August 10, 2017, 04:30 PM ET Alexei Marko - President & CEO John Gillings - JMP Securities Jeffrey Cohen - Ladenburg Thalmann Danielle Antalffy - Leerink Partners Good afternoon, ladies and gentlemen and welcome to the Neovasc Second Quarter Fiscal 2017 Results Conference Call. At this time, all participants are in a listen-only mode. Following the presentation, we will conduct a question-and-answer session. Instructions will be provided at that time for you to queue up for questions. [Operator Instructions] I would like to remind everyone that today's discussions includes forward-looking statements within the meaning of applicable U.S. and Canadian Securities Laws that reflect Neovasc's current views with respect to future events including the Company’s plans and expectations relating to its business, financial results, litigation and other matters. Words such as expect, anticipate, may, will, estimate, continue, intend, believe, trend, and similar words or expressions are meant to identify forward-looking statements. Any such statements are subject to risks and uncertainties that could cause actual results to differ materially from those expressed or implied in the forward-looking statements. For more information on risks and uncertainties related to these forward-looking statements, please refer to the cautionary statement regarding forward-looking statements and Risk Factors section of Neovasc's second quarter MD&A which is available on SEDAR and EDGAR. Now, I would like to turn the call over to Alexei Marko, Chief Executive Officer of Neovasc. Please go ahead sir. Thank you, Sylvie and welcome everyone. With me this afternoon is Chris Clark, our CFO, and as we typically do, we'll begin our call with Chris providing a quick summary of the financials and operations. I'll then review our Tiara and Reducer programs, and then we’ll open it up for questions. Chris? Thank you, Alexei, and good afternoon, everybody. I'll remind everyone that our financial results are in U.S. dollars and prepared in compliance with IFRS. Firstly, for those listening today, I wanted to provide a high-level summary of our ongoing litigation with CardiAQ. In our financial statements, we have fully provided for the monetary judgments awarded against the company of $112.2 million, which includes damages, enhanced damages, and pre and post judgment interest up to June 30, 2017. As you will recall, the trial court in Boston has granted the company stay of judgment, pending the completion of the company's appeal against these damages. Concurrent with the stay, the trial court required the company to place $70 million into escrow. And all hearing related to the appeal of these judgments took place as scheduled earlier this week, and we expect a ruling from the U.S. court of appeals in the coming months. On the German litigation related to the same matter during the second quarter Munich court found that CardiAQ contributed in part to the invention of the Tiara and the awarded them co-entitlement rights to the disputed Tiara European patent application. There are no monetary awards associated with the German litigation and no damages are being recognized in the financial statements. The company is in the process of appealing this decision. I'll now turn to the other elements of the financial statements. In the second quarter of 2017, revenue was $1.3 million, decreasing by 24% from the same period last year. The decrease was expected as the company transitions its business away from its traditional revenue streams towards development and commercialization of its own products, the Reducer and the Tiara. In particular, contract manufacturing revenues dropped substantially compared to the same period last year as the company sold its business supplying tissue to Boston Scientific in late 2016. The proceeds from this sale were placed in escrow and used to secure the stay of the damages awarded against the company. Moving to Reducer, revenues for the company's innovative device to treat refractory angina were $247,000 for the quarter, a flat quarter with 1% increase for the same period over last year. We are closely monitoring sales activity of the Reducer and our analysis continues to be positive. We have observed a significant increase in the underlying implant rate year-over-year and while we may see revenue volatility on a quarterly basis from time to time, we continue to be very encouraged by the growth in the numbers of the procedures. The gross margin for the second quarter of 2017 was 33% compared to 90% for the same period last year, due to a change in the product mix with high-margin products representing an increase in share of the overall revenue. Total expenses for the second quarter of 2017 were $6.7 million compared to $13.3 million for the same period last year, representing a decrease of 49%. The decrease in total expenses principally relates to a $5.2 million reduction in litigation expenses compared to the same period last year. As well, product development and clinical trial expenses to advance the Tiara and our Reducer programs decreased by $1.5 million compared to the same period last year as we focused on clinical progress for the Tiara. The loss for the second quarter was $5.3 million or $0.07 basic and diluted loss per share compared to $83.7 million or $1.25 basic and diluted loss per share for the same period last year. The $78.4 million decrease in the operating loss compared to the same period last year can be substantially explained by the $70 million damages provision related to litigation of CardiAQ charged in the second quarter of 2016 and $5.2 million reduction in litigation expenses compared to the same period last year related to the same matter. It should be noted that the company has incurred significant costs in defending itself in its lawsuit with CardiAQ. Total litigation expenses since the initial claims were filed in June 2014 are $22.5 million and the company may require an additional $0.5 million to cover litigation expenses related to the U.S. appeal and an additional $1 million related to the German appeal. As at June 30m 2017 the company had cash and cash equivalents of $11.6 million compared to $23.0 million at December 31, 2016. The company also has $70.2 million of cash held in escrow pending the outcome of the company's ongoing appeal with CardiAQ. During the second quarter cash used in operating activities were $3.9 million a $7.2 million decrease compared to the same period last year and a $2.4 million decrease compared to the first quarter 2017. The company is satisfied that it is correctly allocating its cash resources towards the development of its key product lines and is monitoring its cash and used reserve cash up to the ultimate decision from the U.S. court of appeals. As you will note from our recent filings the company is in a working capital deficit position of $29.8 million as a result of recognizing the damages provision of $112.2 million related to our litigation with CardiAQ offset by cash held in escrow of $70.2 million. While we intend to continue to vigorously defend ourselves in the litigation with CardiAQ, the outcome of these matters including whether the company will be required to pay some or all of the $112.2 million award is not currently determinable. Litigation is inherently uncertain, therefore until the CardiAQ litigation matters are being resolved the conclusion by the appropriate courts the company cannot give any assurances as to the outcomes. If we are unsuccessful in defending these claims, including the appeal of the verdict in litigation of CardiAQ or unable to settle the claims in a manner satisfactory to the company, we may be faced with significant monetary damages that could exceed the $70.2 million cash held in escrow and/or the resources. The company could require significant additional financing in order to pay the damages and to continue to operate the business. There can be no assurance that such financing will be available on favorable terms or at all. If the above noted circumstances indicate the existence of material uncertainty and cast substantial doubt about the company's ability to continue is a growing concern. We will continue as always to update the market as material events occur. I will now hand the proceedings back to Alexei. Thanks, Chris. The Neovasc Reducer continues to perform well across Europe and neighboring jurisdictions. Sales are strong, margins are strong. New sites continue to be nurtured and reorder rates are consistent. Most importantly across the almost 500 cases performed to date physician feedback is excellent and we view this as a leading indicator that patient outcomes are excellent as well. As mentioned last call, we are only investing modestly in the Reducer rollout, but it is now routinely used in 12 countries at approximately 73 clinics and hospitals. In the U.S. we are in ongoing discussions with the FDA resulting in questions they have regarding our clinical program in anticipation of starting a pivotal IDE study for Reducer. I would describe these discussions as advanced and expect a more detailed update next time we have a call. But without a doubt the European rollout has greatly informed our understanding of this product and more undoubtedly support our initiatives in the United States and this proprietary device. Moving on to Tiara, we have now treated 33 patients with Tiara and additional patients are scheduled or being scheduled presently. The technical success rates remain high and 30-day survival rates are 88% for those patients treated more than 30 days ago. Minor tweaks to the product's design and ongoing procedural improvements have all contributed to these successes and we continue to learn and improve with every case we do. And as we like to report on, one of our first patients ever treated with Tiara almost three and a half years ago is alive and well. We continue to be very happy with the results and performance of Tiara, and we are confident that Tiara continues to be one of the leading programs in this field as we continue to enroll patients and expand our activities to help more patients. In Europe we are excited to have started our CE Mark trial and we recently received UK regulatory approval to begin enrolling patients there into the study protocol. So we are now active in three countries, UK, Germany and Italy and we expect to be adding sites in these countries over the coming months as well as seeking regulatory approval in additional jurisdictions for this study. Also during the quarter, new patents were issued in the U.S. that provided key coverage related to how the Tiara is employed in our [indiscernible] function. Clearly the next few months will provide some clarity for the company's path forward as the U.S. appeals process is completed and hopefully we will receive a decision from the appeals court. Despite the uncertainties still surrounding the outcome of litigation, you can see how the Reducer and the Tiara are making critical advancements commercially and in regulatory matters. Our teams are working on these initiatives are not distracted by the litigation and they understand it is out of their control and they remain focused on their priorities and are genuinely excited by the meaningful progress. The team is motivated by being champions in pioneering new standards of care in structural heart disease that affects millions of patients. Every time we open a new Reducer center or successfully place a Tiara in a patient suffering from severe MR to provide them with a new, well functioning valve we are reminded that we are the cutting edge of this field and changing patients lives for the better and the value that this provides. I'll close my prepared remarks there and open the floor to question and answer. I will just remind everyone that there are many questions related to the ongoing litigation and we unfortunately cannot answer at the present time. We are simply not in a position to comment further on pending litigation beyond what we have already stated today and what is in our latest regulatory filings. With that said, I'd like to turn the call back over to our moderate and open the floor to any questions that you may have. Question-and-Answer Session Thank you, sir. [Operator Instructions] And your first question will be from John Gillings at JMP Securities. Please go ahead. Hey guys, can you hear me okay? Hi John, yes we can hear you fine. Okay, perfect. So I know you don’t want any questions about the case, but I'm going to ask you a question on the case anyway. Just from a procedural perspective is there anything we know at this time? For example do we know when we will get a ruling from the appeal, or do we know what the next steps might be assuming that either party isn’t satisfied with the outcome of the appeal? Yes, really at this stage of the game it is in the hands of the appeal court. The appeal court is a three-judge panel. We had a very short oral hearing in front of them earlier this week. They have the briefs in front of them and they have asked a number of questions at the oral hearing and really they are often considering that. We believe, my understanding is that they will come back with some sort of a verdict and that will come when it comes. It could be anytime from a few weeks from now to a few months from now. There is really no set timeframe for that. But it is in their hands and there really should not be any more briefs submitted or anymore discussion it's really at the point of them being often deliberating that. Okay, and just another one, and this is again procedural and I do not know if you have a good answer to that. As somebody who is not an attorney I don’t really know that much about how things work. It is my understanding that in the appeals process that it's a little bit more focused on the judge is actually digging through the documents that were submitted and you know making more of a legal judgment rather than focus as much on the oral arguments. Is that kind of the right way to think about the process? Yes that is correct, with the obvious claim that I'm not a lawyer. My understanding and how I believe this process runs at this point, it is not a retrying of the original case. It really is looking at legal issues related to the original case and then making a decision on points of the law versus essentially a retrial. Okay and then just turning to the cash side really quick and then I will jump out of the way and let other people come in. So it looks like you burned under $5 million in cash this quarter down probably close to $1 million from last quarter. Is that kind of a level that we might see for the next quarter or two or is there anything that you think might change that in the next couple of quarters? I think that the $4.6 we were pleased that it certainly reflects some of the constraints that we put in place to manage our cash and to really focus on experience of the Tiara. I think the $4.6 million is a reasonable indicator for future periods, but obviously clinical experience and the rate of clinical experience may impact that upward or downwards. So obviously we have limited cash resources and we're looking to preserve those. So yes, I think it's a reasonable indicator. Okay, and then just one more on the finances and then I’ll jump. The last quarter I had asked you guys about the potential to potentially petition the court to draw on the escrow funds if it became necessary and I just want to see if there is any updated thinking there is that something that has been raised with the court at this point? Yes, John that's something we're looking into at present. Right now our focus really is on managing our cash so that we can get through the appeal on the cash that we have and we believe we are going to be able to do that, but we're obviously watching that quite closely and monitoring it and we'll look at other opportunities or other options if that seems like it's going to be a problem. But yes, looking at drawing some money out of escrow was something that we were actively looking at as well. Okay, well, thanks a lot guys and congrats on the clinical progress. Thanks John, I appreciate it. Thank you. [Operator Instructions] And your next question will be from Jeffrey Cohen at Laden Thalmann. Please go ahead. Hi Alex and Chris, can you hear me okay? Yes, Jeff we can hear you fine. Hey super, so I wanted to dig into Tiara a little bit and just wanted to kind of throw some questions at you as far as the three countries now and the potential start if you could kind of give us further color on dates and this trial looks like it would still be in the 100 to 115 range or number of surgeons now that are going to implant or some of the experience that you've probably kind of heard from the implants as far as the time and any complications or number of sizing used and you still believe you're on track for completion in ’18 from that CE trial? Sure and I’ll sort of, I’ll tried to, there is a lot there, but I'll try to work through that. In terms of the countries, yes it is. Currently Italy which we've been in for a while and we've done a number of implants there; Germany is now approved. To the best of my knowledge we are the only CE Mark study approved in Germany and we're, I think we're quite happy with that. And we've just started implanting there and I think the first center got going over the couple of weeks ago. We're in the process of bringing on additional centers there and in fact our folks are in Germany right now doing initiation of a number of new sites. The UK we just received approval for a couple weeks ago and we're underway on getting the UK sites up and running, obviously looking at adding some additional sites in other countries as well, but we'll provide clarity on that as those approvals come in. In terms of feedback from clinicians, it continues to be positive. The device is performing as intended. The implantations have typically gone well without any undue complications. The patients seem to be generally recovering well. The device is functioning well. We don’t see any leaks. We see good device function, so we're quite happy with it. The study is still 115 patients, nothing has changed there. It's still little hard to determine a final date or when we expect to complete enrolment. Obviously the last couple of months we've been as we've been bringing new countries and new centers on it may be in the summer months which and in particular in Europe really slow things down and make it hard to schedule cases. So I think we'll get a much better feel for enrollment cadence as we head into September, October and everybody is back at work and it's easier for us to pull everything together to schedule the cases. But we have a lot of patients in the queue, a lot of patients at various different points in screening. So I think we're going to see things really pick up and I'm hopeful we can get through them in 2018 and that's certainly our target, but I think before we can really kind of confirm that we have to see how the cadence is in the fall. Okay and should we anticipate a bit of a slowdown I mean anywhere from 17 at the end of Q1 to 33 this quarter should that slow down a little bit during the third quarter and then pick up again in the fourth is that a good way to think about it? Yes little bit, June is a little slower, July, August are typically quite slow months. We're working to get a bunch of patients set up for September, October and I am hopeful we will be successful with that. But again it becomes hard to schedule these things when everybody is off on and when half the team is off on holiday at the hospitals that we're working with. So September might not be as much of a pick up as I would hope, but certainly in October and November we expect to see it picking up substantially. And how many, how many surgeons are implanting in Italy and in Germany that you’re aware of? I believe we have three centers up and running in Italy and then in Germany I think we're up to three centers now as well. Okay, and you're awaiting on the first to go in the UK? Perfect. Okay that does it from me. Thanks for taking the questions. Thank you. Next question will be from Danielle Antalffy at Leerink Partners. Please go ahead. Hey, good afternoon, guys. Thanks so much for taking the question. Alexei I was just hoping to ask some Tiara questions, trying to get a better sense of the potential cadence and understanding that it's hard to predict it. But maybe what's a realistic and so you added, I think you were at 28 patients as of the last report, is that right and now 33?  Yes, so within the last three months you've added five patients. I mean what's a realistic at full scale all centers onboard, what's a realistic quarterly run rate for patient adds to the trial? And maybe another way to ask the question of all the patients you screen what percentage of those patients actually get into the trial? So that's, so the overall screening number that's obviously is a difficult question to answer because our intent in screening patients is to really bail them out early if they seem like just a nonstarter or patients that are just not going to be suitable for us we sort of try to avoid even doing an analysis on them. We just don't want to go through the data collection. And so we're sort of - we're working to try and streamline that process. In terms of overall cadence and what we're hoping for, at the end of the day we'd like to have while we're setting ourselves up have 10 centers up and running over the next, by within the next month or so and we may expand that to a few more centers, but we will sort of see how things go. Once we get 10 to 12 centers up and running we would hope that those centers would be doing at least a case a month. And so you get a cadence in that 10 patients a month kind of rate. One of the limiting factors that we've had to-date has been our own teams and our ability to support these cases. Obviously given the criticality of all these cases at this stage of the game we'd like to have our teams and we'd like to have experienced doctors there, so that we can just ensure that everything goes as smoothly as possible. We are in the process of expanding our teams and training additional doctors so that we'll have multiple teams that can go and support these cases and we're not as constrained on our own site in terms of support. So I think at the end of the day our intent will be to be doing, patient a month or more at roughly a dozen centers. Okay, that’s helpful. And then as far as new surgeons that are coming online and using the device, do you see them catching on fairly quickly? What's been the early experience and results when new centers come online and new physicians start implanting, has it been pretty consistent? Yes, it has. Really we – we say all right that we learn with each case and we've been streamlining the procedure and that's a lot of that really goes to training and understanding just the - simplifying the steps of the procedure. So, we really have refined our physician training and our team trained, so that when we move into a new hospital we are able to get them up to speed very quickly and really walk them through the basic steps and we have a number of models that we use to get them thoroughly trained on the device and ready, so that they can go in and be effective within a day or two of the initial training. And so far that's really been working quite well. So we typically coming in the day before, we'll spend an afternoon and evening training and then we'll have a proctor support the case and to date that’s been working very well. Okay and then last question for you, anything coming over the last few months of the year from a medical meeting presentation perspective that we can look out for TCT [ph] end of October or early November, anything we can expect for Tiara there? I think we'll be, yes we'll be attending all the usual conferences. I think we'll be looking at something at London there is [indiscernible] coming up, there is TCT. So where possible we'll be presenting and giving updates at suitable conferences. I think we've gotten – we are sort of regularly giving updates on patient numbers now in our news releases and then, giving more detailed clinical updates at the major conferences and reporting on those, so yes we'll be doing that as we always have. Thanks, so much guys. Terrific. Thanks Danielle. Thank you. And at this time Mr. Marko, we have no questions registered. I would like to turn the call back over to you sir. Thank you everyone for attending our call today and we look forward to talking to you again soon. Have a good afternoon. Thank you, sir. Ladies and gentlemen, this does indeed conclude your conference call for today. Once again, thank you for attending and at this time we do ask that you please disconnect your lines. Have yourself a lovely evening. Copyright policy: All transcripts on this site are the copyright of Seeking Alpha. However, we view them as an important resource for bloggers and journalists, and are excited to contribute to the democratization of financial information on the Internet. (Until now investors have had to pay thousands of dollars in subscription fees for transcripts.) So our reproduction policy is as follows: You may quote up to 400 words of any transcript on the condition that you attribute the transcript to Seeking Alpha and either link to the original transcript or to www.SeekingAlpha.com. All other use is prohibited. THE INFORMATION CONTAINED HERE IS A TEXTUAL REPRESENTATION OF THE APPLICABLE COMPANY'S CONFERENCE CALL, CONFERENCE PRESENTATION OR OTHER AUDIO PRESENTATION, AND WHILE EFFORTS ARE MADE TO PROVIDE AN ACCURATE TRANSCRIPTION, THERE MAY BE MATERIAL ERRORS, OMISSIONS, OR INACCURACIES IN THE REPORTING OF THE SUBSTANCE OF THE AUDIO PRESENTATIONS. IN NO WAY DOES SEEKING ALPHA ASSUME ANY RESPONSIBILITY FOR ANY INVESTMENT OR OTHER DECISIONS MADE BASED UPON THE INFORMATION PROVIDED ON THIS WEB SITE OR IN ANY TRANSCRIPT. USERS ARE ADVISED TO REVIEW THE APPLICABLE COMPANY'S AUDIO PRESENTATION ITSELF AND THE APPLICABLE COMPANY'S SEC FILINGS BEFORE MAKING ANY INVESTMENT OR OTHER DECISIONS. If you have any additional questions about our online transcripts, please contact us at: transcripts@seekingalpha.com. Thank you!"}]