[{"label": "spam", "published": "Tue, 05 Sep 2017 18:53:00 GMT", "url": "https://www.stocknewsgazette.com/2017/09/05/checking-out-the-fundamental-data-for-neovasc-inc-nvcn/", "title": "Checking Out the Fundamental Data for Neovasc Inc. (NVCN) – Stock News Gazette", "body": " No spam. No Hidden Fees. Unsubscribe Anytime. Neovasc Inc. (NASDAQ:NVCN) has recently been identified as an interesting stock but more in-depth monitoring is needed for a trade decision. Now trading with a market value of 89.94M, the company has a mix of catalysts and obstacles that spring from the nature of its operations. In light of the many issues surrounding this company, we thought it was a good time to take a close look at the numbers in order to form a realistic perspective on the fundamental picture for this stock. Neovasc Inc. (NASDAQ:NVCN) Fundamentals That Matter It’s generally a good idea to start with the most fundamental piece of the picture: the balance sheet. The balance sheet health of any company plays a key role in its ability to meet its obligations and maintain the faith of its investment base. For NVCN, the company currently has 106.2 million of cash on the books. The trend over time is important to note. In this case, the company’s debt has been growing. The company also has 112.83 million in total assets, balanced by 148.58 million in total liabilities, which should give you a sense of the viability of the company under any number of imagined business contexts. Neovasc Inc. (NVCN) saw -5.42 million in free cash flow last quarter, representing a quarterly net change in cash of -6.09 million. Perhaps most importantly where cash movements are concerned, the company saw about -5.26 million in net operating cash flow. Neovasc Inc. (NASDAQ:NVCN) Revenue Growth Potential As far as key trends that demonstrate something of the future investment potential of this stock, we need to take a closer look at the top line, first and foremost. Last quarter, the company saw 1.75 million in total revenues. That represents a quarterly year/year change in revenues of -0.21 in sequential terms, the NVCN saw sales decline by -0.11. But what about the bottom line? After all, that’s what really matters in the end. Neovasc Inc. (NVCN) is intriguing when broken down to its core data. The cost of selling goods last quarter was 1.34 million, yielding a gross basic income of 415,824. For shareholders, given the total diluted outstanding shares of 78.83 million, this means overall earnings per share of -0.09. Note, this compares with a consensus analyst forecast of -0.02 in earnings per share for its next fiscal quarterly report. Is Neovasc Inc. (NASDAQ:NVCN) Valuation Attractive Looking ahead at valuations, according to the consensus, the next fiscal year is forecast to bring about -0.16 in total earnings per share. If we consider a median price to earnings ratio on the stock, that corresponds with a stock price of 9,999. However, one should always remember: the trends are more important than the forecasts. This continues to be an interesting story, and we look forward to updating it again soon on Neovasc Inc.. Stock News Gazette is news organization focusing on small cap companies. Our mission is to provide unequaled news and insight to knowledgeable investors looking to execute the best possible public and private capital allocation decisions."}, {"label": "spam", "published": "Fri, 08 Sep 2017 14:34:08 GMT", "url": "https://uniontradejournal.com/technical-trading-focusing-on-shares-of-neovasc-inc-nvcn/251843/", "title": "Technical Trading: Focusing on Shares of Neovasc Inc (NVCN) | Union Trade Journal", "body": "Viewing the technical levels for Neovasc Inc (NVCN), we have recorded the SuperTrend line underneath a recent stock price check. According to the signal, this may indicate that the stock has entered sell territory.Investors may be looking to compare the current stock price of Neovasc Inc (NVCN) to some of its moving averages. After a recent check, the 200-day MA is resting at 1.42, and the 50-day is 1.14. Moving averages are considered to be lagging indicators that simply take the average price of a stock over a specific period of time. Moving averages can be very useful for identifying peaks and troughs. They may also be used to help the trader figure out proper support and resistance levels for the stock.Investors may use various technical indicators to help spot trends and buy/sell signals. Presently, Neovasc Inc (NVCN) has a 14-day Commodity Channel Index (CCI) of 118.69. The CCI was developed by Donald Lambert. The assumption behind the indicator is that investment instruments move in cycles with highs and lows coming at certain periodic intervals. The original guidelines focused on creating buy/sell signals when the reading moved above +100 or below -100. Traders may also use the reading to identify overbought/oversold conditions.Neovasc Inc (NVCN)’s Williams Percent Range or 14 day Williams %R presently is at -25.37. In general, if the reading goes above -20, the stock may be considered to be overbought.When applying indicators for technical analysis, traders and investors might want to examine the ATR or Average True Range. The current 14-day ATR for Neovasc Inc (NVCN) is currently sitting at 0.13. The ATR basically measures the volatility of a stock on a day-to-day basis. The average true range is typically based on 14 periods and may be calculated daily, weekly, monthly, or intraday. The ATR is not considered a directional indicator, but it may reflect the strength of a particular move.The 14-day ADX for Neovasc Inc (NVCN) is currently sitting at 53.77. Generally speaking, an ADX value from 0-25 would indicate an absent or weak trend. A value of 25-50 would indicate a strong trend. A value of 50-75 would signal a very strong trend, and a value of 75-100 would indicate an extremely strong trend. The ADX is a technical indicator developed by J. Welles Wilder used to determine the strength of a trend. The ADX is often used along with the Plus Directional Indicator (+DI) and Minus Directional Indicator (-DI) to identify the direction of the trend. By Journal Contributor Viewing the technical levels for Neovasc Inc (NVCN), we have recorded the SuperTrend line underneath a recent stock price check. According to the signal, this may indicate that the stock has entered sell territory. Investors may be looking to compare the current stock price of Neovasc Inc (NVCN) to some of its moving averages. After a recent check, the 200-day MA is resting at 1.42, and the 50-day is 1.14. Moving averages are considered to be lagging indicators that simply take the average price of a stock over a specific period of time. Moving averages can be very useful for identifying peaks and troughs. They may also be used to help the trader figure out proper support and resistance levels for the stock. Investors may use various technical indicators to help spot trends and buy/sell signals. Presently, Neovasc Inc (NVCN) has a 14-day Commodity Channel Index (CCI) of 118.69. The CCI was developed by Donald Lambert. The assumption behind the indicator is that investment instruments move in cycles with highs and lows coming at certain periodic intervals. The original guidelines focused on creating buy/sell signals when the reading moved above +100 or below -100. Traders may also use the reading to identify overbought/oversold conditions. Neovasc Inc (NVCN)’s Williams Percent Range or 14 day Williams %R presently is at -25.37. In general, if the reading goes above -20, the stock may be considered to be overbought. When applying indicators for technical analysis, traders and investors might want to examine the ATR or Average True Range. The current 14-day ATR for Neovasc Inc (NVCN) is currently sitting at 0.13. The ATR basically measures the volatility of a stock on a day-to-day basis. The average true range is typically based on 14 periods and may be calculated daily, weekly, monthly, or intraday. The ATR is not considered a directional indicator, but it may reflect the strength of a particular move. The 14-day ADX for Neovasc Inc (NVCN) is currently sitting at 53.77. Generally speaking, an ADX value from 0-25 would indicate an absent or weak trend. A value of 25-50 would indicate a strong trend. A value of 50-75 would signal a very strong trend, and a value of 75-100 would indicate an extremely strong trend. The ADX is a technical indicator developed by J. Welles Wilder used to determine the strength of a trend. The ADX is often used along with the Plus Directional Indicator (+DI) and Minus Directional Indicator (-DI) to identify the direction of the trend.  By Journal Contributor"}, {"label": "spam", "published": "Fri, 08 Sep 2017 07:50:00 GMT", "url": "https://www.postanalyst.com/2017/09/08/analyzing-stocks-on-analyst-opinion-randgold-resources-limited-gold-neovasc-inc-nvcn/", "title": "Analyzing Stocks On Analyst Opinion: Randgold Resources Limited (GOLD), Neovasc Inc. (NVCN) | Post Analyst", "body": "Randgold Resources Limited (NASDAQ:GOLD) notched a 3.83% intraday gain moving at $107.9. When the opening bell rang, the price was $106.01. The number of shares that were traded during the day was 0.89 million, which corresponds to its 3-month volume average of 0.59 million shares a day.   Randgold Resources Limited has a consensus outperform rating from 4 Wall Street analysts, and the number of shares currently sold short amount to at least 1.59% of shares outstanding. The stock spiked 15.49% last month and is up 41.34 this year. Wall Street is only getting more bullish on the stock, with 3 of analysts who cover GOLD having a buy-equivalent rating. Analysts have placed a $111.39 price target on Randgold Resources Limited, suggesting a 3.23% gain from recent close. It’s currently trading about 1.78% above its 52-week high.  Randgold Resources Limited (GOLD) surprised the stock market in its last reported earnings when it earned $0.88 a piece versus the consensus-estimated $0.76. Its revenue totaled $349.45 million up 28.79% from the previous quarter.   This stock (GOLD) is ahead of its 52-week low with 59.76%. Its last month’s stock price volatility remained 1.7% which for the week stands at 1.51%. The share price has moved forward from its 20 days moving average, trading at a distance of 9.55% and stays 15.31% away from its 50 days moving average. Over the last five days, shares have managed 5.91% gains and now is up 22.57% since hitting its 200-day moving average of $91.92. Randgold Resources Limited (GOLD) has made its way to a 12-month gain of 3.7%.  Turning to Neovasc Inc. (NASDAQ:NVCN), its shares were trading at $1.2 a retreat of $-0.07, on the trading floor. The stock, after opening at $1.26, touched a high of $1.3 before paring much of its gains. So far, analysts are sticking with their bullish recommendations with the consensus call at 1. Neovasc Inc. has 1 buy ratings, 0 holds and 0 sells even after the stock tumbled -64.07% from its high of $3.34 to a $94.68 million market value through last close.  The company’s consensus rating on Reuter’s scale improved from 1.5 to 1.67 during a month. Analysts set a 12-month price target of $4 a share. The target implies a 233.33% spike from where the shares are currently trading. Also, the current price highlights a discount of 956.67% to analysts’ high consensus price target.  The counter witnessed a trading volume of 0.43 million shares versus an average volume of 0.29 million shares during last trading session. Its last month’s stock price volatility remained 25.61% which for the week approaches 14.4%. The lowest price the stock reached in the last trading day was $1.18 and compares with the $0.45 52-week low. The stock recovered 166.67% since its low point and has performed -30.64% year-to-date."}, {"label": "spam", "published": "Fri, 08 Sep 2017 18:05:31 GMT", "url": "https://midwaymonitor.com/trend-indicator-levels-for-neovasc-inc-nvcn-to-in-focus/223907/", "title": "Trend Indicator Levels For Neovasc Inc (NVCN.TO) in Focus – Midway Monitor", "body": "Neovasc Inc (NVCN.TO) has a 14-day Commodity Channel Index (CCI) of 60.24. The CCI was designed to typically remain within the reading of -100 to +100. Traders may use the indicator to spot stock trends or to seek out overbought/oversold conditions. A CCI reading over +100 would suggest that the stock is overbought and possibly ready for a correction. On the flip side, a reading of -100 would imply that the stock is oversold and possibly set for a rally.A popular tool among technical stock analysts is the moving average. Moving averages are considered to be lagging indicators that simply take the average price of a stock over a certain period of time. They may also be used to assist the trader figure out proper support and resistance levels for the stock. Currently, Neovasc Inc (NVCN.TO) has a 200-day MA of 1.88, and a 50-day of 1.44. Presently, the stock has a 14-day RSI of 51.52, the 7-day is sitting at 54.20, and the 3-day is resting at 41.66. The Relative Strength Index (RSI) is one of multiple popular technical indicators created by J. Welles Wilder. Wilder introduced RSI in his book “New Concepts in Technical Trading Systems” which was published in 1978. RSI measures the magnitude and velocity of directional price movements. The data is represented graphically by fluctuating between a value of 0 and 100. The indicator is computed by using the average losses and gains of a stock over a certain time period. RSI can be used to help spot overbought or oversold conditions. An RSI reading over 70 would be considered overbought, and a reading under 30 would indicate oversold conditions. A level of 50 would indicate neutral market momentum. Neovasc Inc (NVCN.TO)’s Williams Percent Range or 14 day Williams %R presently is at -42.68. In general, if the reading goes above -20, the stock may be considered to be overbought. Alternately, if the indicator goes under -80, this may show the stock as being oversold. We can also take a look at the Average Directional Index or ADX of the stock. For traders looking to capitalize on trends, the ADX may be an essential technical tool. The ADX is used to measure trend strength. ADX calculations are made based on the moving average price range expansion over a specified amount of time. ADX is charted as a line with values ranging from 0 to 100. The indicator is non-directional meaning that it gauges trend strength whether the stock price is trending higher or lower. The 14-day ADX presently sits at 41.27. In general, and ADX value from 0-25 would represent an absent or weak trend. A value of 25-50 would indicate a strong trend. A value of 50-75 would indicate a very strong trend, and a value of 75-100 would signify an extremely strong trend.With equity investing, there will constantly be worries and fears. The volatility in the market that accompanies these fears may trick investors into thinking the next bear market is on the doorstep. During a market-wide sell off, many stocks may experience the pain. Over time, many may gain back the ground they lost and return to previous levels. The biggest names may be the ones to recoup the losses the quickest. However, many investors might get stuck waiting for a rebound that just isn’t going to happen. Having the flexibility to adapt to market conditions may help repair a damaged portfolio. Sometimes a readjustment may be needed in order to regain some confidence. As the next round of earnings reports start to come in, investors will be keeping a close watch to see which companies produce the largest surprises, both positive and negative.LoadPopupRatings('MBAP-Popup-MBAP-Popup-midwaymonitor', 'NONE:NVCN.TO', 'Neovasc Inc', 'http://davidsonregister.com/wp-content/uploads/2017/02/davidon.png'); Neovasc Inc (NVCN.TO) has a 14-day Commodity Channel Index (CCI) of 60.24. The CCI was designed to typically remain within the reading of -100 to +100. Traders may use the indicator to spot stock trends or to seek out overbought/oversold conditions. A CCI reading over +100 would suggest that the stock is overbought and possibly ready for a correction. On the flip side, a reading of -100 would imply that the stock is oversold and possibly set for a rally. A popular tool among technical stock analysts is the moving average. Moving averages are considered to be lagging indicators that simply take the average price of a stock over a certain period of time. They may also be used to assist the trader figure out proper support and resistance levels for the stock. Currently, Neovasc Inc (NVCN.TO) has a 200-day MA of 1.88, and a 50-day of 1.44. Presently, the stock has a 14-day RSI of 51.52, the 7-day is sitting at 54.20, and the 3-day is resting at 41.66. The Relative Strength Index (RSI) is one of multiple popular technical indicators created by J. Welles Wilder. Wilder introduced RSI in his book “New Concepts in Technical Trading Systems” which was published in 1978. RSI measures the magnitude and velocity of directional price movements. The data is represented graphically by fluctuating between a value of 0 and 100. The indicator is computed by using the average losses and gains of a stock over a certain time period. RSI can be used to help spot overbought or oversold conditions. An RSI reading over 70 would be considered overbought, and a reading under 30 would indicate oversold conditions. A level of 50 would indicate neutral market momentum.  Neovasc Inc (NVCN.TO)’s Williams Percent Range or 14 day Williams %R presently is at -42.68. In general, if the reading goes above -20, the stock may be considered to be overbought. Alternately, if the indicator goes under -80, this may show the stock as being oversold. We can also take a look at the Average Directional Index or ADX of the stock. For traders looking to capitalize on trends, the ADX may be an essential technical tool. The ADX is used to measure trend strength. ADX calculations are made based on the moving average price range expansion over a specified amount of time. ADX is charted as a line with values ranging from 0 to 100. The indicator is non-directional meaning that it gauges trend strength whether the stock price is trending higher or lower. The 14-day ADX presently sits at 41.27. In general, and ADX value from 0-25 would represent an absent or weak trend. A value of 25-50 would indicate a strong trend. A value of 50-75 would indicate a very strong trend, and a value of 75-100 would signify an extremely strong trend. With equity investing, there will constantly be worries and fears. The volatility in the market that accompanies these fears may trick investors into thinking the next bear market is on the doorstep. During a market-wide sell off, many stocks may experience the pain. Over time, many may gain back the ground they lost and return to previous levels. The biggest names may be the ones to recoup the losses the quickest. However, many investors might get stuck waiting for a rebound that just isn’t going to happen. Having the flexibility to adapt to market conditions may help repair a damaged portfolio. Sometimes a readjustment may be needed in order to regain some confidence. As the next round of earnings reports start to come in, investors will be keeping a close watch to see which companies produce the largest surprises, both positive and negative."}, {"label": "spam", "published": "Fri, 08 Sep 2017 11:00:28 GMT", "url": "https://lenoxledger.com/keeping-up-on-neovasc-inc-nvcn-tos-technicals-where-to-from-here/", "title": "  Keeping Up on Neovasc Inc (NVCN.TO)’s Technicals: Where to From Here?", "body": "Neovasc Inc (NVCN.TO) shares are showing strong upward momentum according to the Aroon indicator as the reading has climbed above 70.  With the strength building, investors might be taking a look at this name in conjuction with some other indicators.The Aroon Oscillator was developed by Tushar Chande to highlight the start of a new trend and to measure trend strength. Chande first described the indicator in the September 1995 issue of Stocks & Commodities magazine. The Aroon indicator system consists of three lines: Aroon Up, Aroon Down, and the Aroon Oscillator which reflects the difference between the two. “Aroon” is a Sanskrit word meaning “dawn’s early light”.Chande recommends the following signals:Aroon Up level above 70 indicates a strong up-trend while Aroon Down above 70 indicates a strong down-trend. Aroon Up below 50 warns that the up-trend is weakening while Aroon Down below 50 signals that the down-trend is weakening. The two moving lower in close proximity indicates consolidation, and no clear trend.Shifting focus to some additional indicators, Neovasc Inc (NVCN.TO) currently has a 14 day Williams %R of -30.49. In general, if the level goes above -20, the stock may be considered to be overbought. Alternately, if the indicator goes under -80, this may signal that the stock is oversold. The Williams Percent Range or Williams %R is a technical indicator that was developed to measure overbought and oversold market conditions. The Williams %R indicator helps show the relative situation of the current price close to the period being observed.We can also take a look at the Average Directional Index or ADX of Neovasc Inc (NVCN.TO). The ADX is used to measure trend strength. ADX calculations are made based on the moving average price range expansion over a specified amount of time. ADX is charted as a line with values ranging from 0 to 100. The indicator is non-directional meaning that it gauges trend strength whether the stock price is trending higher or lower. The 14-day ADX presently sits at 43.96. In general, and ADX value from 0-25 would represent an absent or weak trend. A value of 25-50 would indicate a strong trend. A value of 50-75 would indicate a very strong trend, and a value of 75-100 would signify an extremely strong trend. At the time of writing, Neovasc Inc (NVCN.TO) has a 14-day Commodity Channel Index (CCI) of 109.93. Developed by Donald Lambert, the CCI is a versatile tool that may be used to help spot an emerging trend or provide warning of extreme conditions. CCI generally measures the current price relative to the average price level over a specific time period. CCI is relatively high when prices are much higher than average, and relatively low when prices are much lower than the average.A commonly used tool among technical stock analysts is the moving average. Moving averages are considered to be lagging indicators that simply take the average price of a stock over a certain period of time. Moving averages can be very helpful for identifying peaks and troughs. They may also be used to assist the trader figure out proper support and resistance levels for the stock. Currently, the 200-day MA for Neovasc Inc (NVCN.TO) is sitting at 1.88. The Relative Strength Index (RSI) is a momentum oscillator that measures the speed and change of stock price movements. The RSI was developed by J. Welles Wilder, and it oscillates between 0 and 100. Generally, the RSI is considered to be oversold when it falls below 30 and overbought when it heads above 70. RSI can be used to detect general trends as well as finding divergences and failure swings. The 14-day RSI is presently standing at 56.11, the 7-day is 62.60, and the 3-day is resting at 57.65.LoadPopupRatings('MBAP-Popup-MBAP-Popup-lenoxledger', 'NONE:NVCN.TO', 'Neovasc Inc', 'http://davidsonregister.com/wp-content/uploads/2017/02/davidon.png'); Neovasc Inc (NVCN.TO) shares are showing strong upward momentum according to the Aroon indicator as the reading has climbed above 70.  With the strength building, investors might be taking a look at this name in conjuction with some other indicators. The Aroon Oscillator was developed by Tushar Chande to highlight the start of a new trend and to measure trend strength. Chande first described the indicator in the September 1995 issue of Stocks & Commodities magazine. The Aroon indicator system consists of three lines: Aroon Up, Aroon Down, and the Aroon Oscillator which reflects the difference between the two. “Aroon” is a Sanskrit word meaning “dawn’s early light”. Chande recommends the following signals: Aroon Up level above 70 indicates a strong up-trend while Aroon Down above 70 indicates a strong down-trend. Aroon Up below 50 warns that the up-trend is weakening while Aroon Down below 50 signals that the down-trend is weakening. The two moving lower in close proximity indicates consolidation, and no clear trend. Shifting focus to some additional indicators, Neovasc Inc (NVCN.TO) currently has a 14 day Williams %R of -30.49. In general, if the level goes above -20, the stock may be considered to be overbought. Alternately, if the indicator goes under -80, this may signal that the stock is oversold. The Williams Percent Range or Williams %R is a technical indicator that was developed to measure overbought and oversold market conditions. The Williams %R indicator helps show the relative situation of the current price close to the period being observed. We can also take a look at the Average Directional Index or ADX of Neovasc Inc (NVCN.TO). The ADX is used to measure trend strength. ADX calculations are made based on the moving average price range expansion over a specified amount of time. ADX is charted as a line with values ranging from 0 to 100. The indicator is non-directional meaning that it gauges trend strength whether the stock price is trending higher or lower. The 14-day ADX presently sits at 43.96. In general, and ADX value from 0-25 would represent an absent or weak trend. A value of 25-50 would indicate a strong trend. A value of 50-75 would indicate a very strong trend, and a value of 75-100 would signify an extremely strong trend. At the time of writing, Neovasc Inc (NVCN.TO) has a 14-day Commodity Channel Index (CCI) of 109.93. Developed by Donald Lambert, the CCI is a versatile tool that may be used to help spot an emerging trend or provide warning of extreme conditions. CCI generally measures the current price relative to the average price level over a specific time period. CCI is relatively high when prices are much higher than average, and relatively low when prices are much lower than the average. A commonly used tool among technical stock analysts is the moving average. Moving averages are considered to be lagging indicators that simply take the average price of a stock over a certain period of time. Moving averages can be very helpful for identifying peaks and troughs. They may also be used to assist the trader figure out proper support and resistance levels for the stock. Currently, the 200-day MA for Neovasc Inc (NVCN.TO) is sitting at 1.88. The Relative Strength Index (RSI) is a momentum oscillator that measures the speed and change of stock price movements. The RSI was developed by J. Welles Wilder, and it oscillates between 0 and 100. Generally, the RSI is considered to be oversold when it falls below 30 and overbought when it heads above 70. RSI can be used to detect general trends as well as finding divergences and failure swings. The 14-day RSI is presently standing at 56.11, the 7-day is 62.60, and the 3-day is resting at 57.65. Your email address will not be published. Required fields are marked *"}, {"label": "spam", "published": "Fri, 08 Sep 2017 18:17:14 GMT", "url": "https://bvnewsjournal.com/putting-neovasc-inc-nvcn-under-the-microscope-technicals-watch-2/198417/", "title": "Putting Neovasc Inc (NVCN)  Under the Microscope: Technicals Watch – BVN Journal", "body": "Shares of Neovasc Inc (NVCN) are moving on volatility today -4.17% or -0.05 from the open. The NASDAQ listed company saw a recent bid of 1.15 on 63864 volume.Investors might be trying to figure out how to play the stock market at current levels. The optimist may see much more upward action in the future while the pessimist may be waiting for the impending disaster. Buying into the market at these levels will no doubt come with a bit of caution. Even at these levels, there may still be some good buys. The average individual investor may need to spend a little more time doing the homework, but it may pay off handsomely if the stock market decides to break out higher. As companies start to report quarterly earnings, investors will be watching to see what types of trends emerge. A generally upbeat earnings season may give the bulls more strength to breakout and continue the charge higher into the later stages of the year.Now let’s take a look at how the fundamentals are stacking up for  Shares of Neovasc Inc (NVCN) are moving on volatility today -4.17% or -0.05 from the open. The NASDAQ listed company saw a recent bid of 1.15 on 63864 volume. Investors might be trying to figure out how to play the stock market at current levels. The optimist may see much more upward action in the future while the pessimist may be waiting for the impending disaster. Buying into the market at these levels will no doubt come with a bit of caution. Even at these levels, there may still be some good buys. The average individual investor may need to spend a little more time doing the homework, but it may pay off handsomely if the stock market decides to break out higher. As companies start to report quarterly earnings, investors will be watching to see what types of trends emerge. A generally upbeat earnings season may give the bulls more strength to breakout and continue the charge higher into the later stages of the year. Now let’s take a look at how the fundamentals are stacking up for  Another ratio we can look at is the Return on Invested Capital or more commonly referred to as ROIC. Neovasc Inc (NVCN) has a current ROIC of -383.11. ROIC is calculated by dividing Net Income – Dividends by Total Capital Invested.  Similar to ROE, ROIC measures how effectively company management is using invested capital to generate company income. A high ROIC number typically reflects positively on company management while a low number typically reflects the opposite.  Turning to Return on Assets or ROA, Neovasc Inc (NVCN) has a current ROA of -105.35. This is a profitability ratio that measures net income generated from total company assets during a given period. This ratio reveals how quick a company can turn it’s assets into profits. In other words, the ratio provides insight into the profitability of a firm’s assets. The ratio is calculated by dividing total net income by the average total assets. A higher ROA compared to peers in the same industry, would suggest that company management is able to effectively generate profits from their assets. Similar to the other ratios, a lower number might raise red flags about management’s ability when compared to other companies in a similar sector. Another key indicator that can help investors determine if a stock might be a quality investment is the Return on Equity or ROE. Neovasc Inc (NVCN) currently has Return on Equity of -383.11. ROE is a ratio that measures profits generated from the investments received from shareholders. In other words, the ratio reveals how effective the firm is at turning shareholder investment into company profits. A company with high ROE typically reflects well on management and how well a company is run at a high level. A firm with a lower ROE might encourage potential investors to dig further to see why profits aren’t being generated from shareholder money."}, {"label": "spam", "published": "Fri, 08 Sep 2017 15:58:40 GMT", "url": "https://www.dispatchtribunal.com/2017/09/08/somewhat-favorable-media-coverage-somewhat-unlikely-to-impact-biostage-bstg-stock-price.html", "title": "Somewhat Favorable Media Coverage Somewhat Unlikely to Impact Biostage (BSTG) Stock Price - Dispatch Tribunal", "body": "\t\t\t\t\tPosted by Amber O'Connor on Sep 8th, 2017 // No Comments  Media stories about Biostage (NASDAQ:BSTG) have been trending somewhat positive on Friday, according to Accern. The research group identifies negative and positive news coverage by analyzing more than twenty million blog and news sources in real-time. Accern ranks coverage of public companies on a scale of negative one to one, with scores closest to one being the most favorable. Biostage earned a media sentiment score of 0.15 on Accern’s scale. Accern also assigned press coverage about the biotechnology company an impact score of 45.578460566102 out of 100, indicating that recent news coverage is somewhat unlikely to have an impact on the company’s share price in the near future.  Here are some of the news stories that may have impacted Accern Sentiment’s rankings:  Separately, Maxim Group  reaffirmed a “hold” rating on shares of Biostage in a report on Monday, August 14th. Shares of Biostage (BSTG) traded up 2.531% during trading on Friday, reaching $0.316. 369,175 shares of the company’s stock traded hands. The stock’s market cap is $12.30 million. Biostage has a one year low of $0.22 and a one year high of $1.42. The company has a 50 day moving average price of $0.41 and a 200-day moving average price of $0.37.  Biostage (NASDAQ:BSTG) last released its quarterly earnings data on Monday, August 14th. The biotechnology company reported ($0.10) EPS for the quarter, missing the Thomson Reuters’ consensus estimate of ($0.07) by $0.03.  On average, equities research analysts expect that  Biostage will post ($0.42) EPS for the current fiscal year.  In related news, insider Saverio Lafrancesca acquired 150,000 shares of the stock in a transaction on Wednesday, August 23rd. The shares were acquired at an average price of $0.32 per share, for a total transaction of $48,000.00. Following the transaction, the insider now owns 193,998 shares in the company, valued at approximately $62,079.36. The purchase was disclosed in a filing with the SEC, which is available through this link. Corporate insiders own  4.30% of the company’s stock.  Biostage Company Profile Biostage, Inc, formerly Harvard Apparatus Regenerative Technology, Inc, is a biotechnology company. The Company is engaged in developing bioengineered organ implants based on its Cellframe technology. Its Cellframe technology consists of a biocompatible scaffold that is seeded with the recipient’s own cells. Receive News & Ratings for Biostage Inc. Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Biostage Inc. and related companies with MarketBeat.com's FREE daily email newsletter. SGOCO Group (SGOC) Receives Coverage Optimism Rating of 0.29 Kiltearn Partners LLP Invests $74.70 Million in United Natural Foods, Inc. (UNFI) Mail (will not be published)  (Required) "}, {"label": "spam", "published": "Thu, 07 Sep 2017 19:08:00 GMT", "url": "https://www.stocknewsgazette.com/2017/09/07/biostage-inc-bstg-interesting-series-of-developments-taking-place/", "title": "Biostage, Inc. (BSTG): Interesting Series Of Developments Taking Place – Stock News Gazette", "body": " No spam. No Hidden Fees. Unsubscribe Anytime. Biostage, Inc. (NASDAQ:BSTG) is on our radar right now but there could still be some opportunities on the horizon. Now trading with a market value of 11.63M, the company has a mix of catalysts and obstacles that spring from the nature of its operations. Everyone seems to have their own opinion of this stock. But what do the numbers really say? We think it’s a great time to take a fresh look. Biostage, Inc. (NASDAQ:BSTG) Fundamentals That Matter It’s generally a good idea to start with the most fundamental piece of the picture: the balance sheet. The balance sheet health of any company plays a key role in its ability to meet its obligations and maintain the faith of its investment base. For BSTG, the company currently has 3.42 million of cash on the books. The trend over time is important to note. In this case, the company’s debt has been growing. The company also has 4.66 million in total assets, balanced by 3.38 million in total liabilities, which should give you a sense of the viability of the company under any number of imagined business contexts. Biostage, Inc. (BSTG) saw -3.16 million in free cash flow last quarter, representing a quarterly net change in cash of -3.16 million. Perhaps most importantly where cash movements are concerned, the company saw about -3.14 million in net operating cash flow. Biostage, Inc. (NASDAQ:BSTG) Revenue Growth Potential As far as key trends that demonstrate something of the future investment potential of this stock, we need to take a closer look at the top line, first and foremost. That represents a quarterly year/year change in revenues of 0.00 in sequential terms, the BSTG saw sales decline by 0.00. But what about the bottom line? After all, that’s what really matters in the end. Biostage, Inc. (BSTG) is intriguing when broken down to its core data. The cost of selling goods last quarter was 115,000, yielding a gross basic income of -115,000 . For shareholders, given the total diluted outstanding shares of 37.12 million, this means overall earnings per share of -0.10. Is Biostage, Inc. (NASDAQ:BSTG) Valuation Attractive We consider a median price to earnings ratio on the stock, that corresponds with a stock price of 9,999. However, one should always remember: the trends are more important than the forecasts. This continues to be an interesting story, and we look forward to updating it again soon on Biostage, Inc.. Stock News Gazette is news organization focusing on small cap companies. Our mission is to provide unequaled news and insight to knowledgeable investors looking to execute the best possible public and private capital allocation decisions."}, {"label": "spam", "published": "Thu, 07 Sep 2017 15:32:00 GMT", "url": "https://stocknewsjournal.com/2017/09/07/why-investors-remained-buoyant-on-mastercard-incorporated-ma-biostage-inc-bstg/", "title": "Why Investors remained buoyant on: Mastercard Incorporated (MA), Biostage, Inc. (BSTG) | StockNewsJournal", "body": "Mastercard Incorporated (NYSE:MA) market capitalization at present is $142.04B at the rate of $132.89 a share. The firm’s price-to-sales ratio was noted 0.00 in contrast with an overall industry average of 88.89. Most of the active traders and investors are keen to find ways to compare the value of stocks. The price-to-sales ratio offers a simple approach in this case. They just need to take the company’s market capitalization and divide it by the company’s total sales over the past 12 months. The lesser the ratio, the more attractive the investment. During the key period of last 5 years, Mastercard Incorporated (NYSE:MA) sales have annually surged 9.90% on average, however its earnings per share growth remained at 20.00%. How Company Returns Shareholder’s Value? Dividends is a reward scheme, that a company presents to its shareholders. There can be various forms of dividends, such as cash payment, stocks or any other form. This payment is usually a part of the profit of the company. A company’s dividend is mostly determined by its board of directors and it requires the shareholders’ approval. Mastercard Incorporated (NYSE:MA) for the trailing twelve months paying dividend with the payout ratio of 0.00% to its shareholders. Currently it is offering a dividend yield of 0.00% and a 5 year dividend growth rate of 0.00%. Over the last year Company’s shares have been trading in the range of $97.49 and $134.50. However yesterday the stock remained in between $132.59 and $133.66. The stock is above its 52-week low with 36.31% and is in the wake of its 52-week high with -1.20%. Performance & Technicalities In the latest week Mastercard Incorporated (NYSE:MA) stock volatility was recorded 0.76% which for the previous full month was noted 0.99%. Meanwhile the stock weekly performance was subdued at -0.71%, which was upheld for the month at 1.93%. Likewise, the upbeat performance for the last quarter was 6.15% and for the full year it was 34.52%. Moreover the Company’s Year To Date performance was 28.71%. Now a days one of the fundamental indicator used in the technical analysis is called Stochastic %D”, Stochastic indicator was created by George Lane. The stochastic is a momentum indicator comparing the closing price of a security to the range of its prices over a fix period of time. The gauge is based on the assumption that if price surges, the closing price tends towards the values that belong to the upper part of the area of price movements in the preceding period. On the other hand if price drops, the contrary is right. For Mastercard Incorporated (NYSE:MA), Stochastic %D value stayed at 47.42% for the last 9 days. Considering more the value stands at 66.47% and 79.43% for 14 and 20 days, in that order. Biostage, Inc. (NASDAQ:BSTG) closed at $0.30 a share in the latest session and the stock value rose almost -66.01% since the beginning of this year. The company has managed to keep price to sales ratio of 0.00 against an industry average of 88.89. The price to sales ratio is the ratio of the market value of equity to the sales. This ratio is internally not steady, since the market value of equity is divided by the total revenues of the firm. Firm’s net income measured an average growth rate of -8.40%. Following last close company’s stock, is -29.30% below their SMA 50 and -78.70% below the 52-week high. A simple moving average (SMA) is an mathematical moving average calculated by adding the closing price of the security for a number of time periods and then dividing this total by the number of time periods. Its most recent closing price has a distance of -17.57% from SMA20 and is -39.58% below than SMA200. In-Depth Technical Study Investors generally keep an extensive variety of technical indicators at their disposal for completing technical stock analysis. The average true range is a moving average, generally 14 days, of the true ranges. The average true range (ATR) was fashioned to allow traders to more precisely evaluate the daily volatility of an asset by using straightforward calculations. However the indicator does not specify the price direction, rather it is used first and foremost to measure volatility caused by gaps and limit up or down moves. The ATR is fairly simple to calculate and only needs historical price data. ATR is counted for different periods, like 9-day, 14-day, 20-day, 50-day and 100-day. At the moment, the 14-day ATR for Biostage, Inc. (NASDAQ:BSTG) is noted at 0.05."}, {"label": "spam", "published": "Thu, 31 Aug 2017 20:50:50 GMT", "url": "https://simplywall.st/news/2017/09/01/is-biostage-inc-bstg-overpaying-its-ceo/", "title": "Is Biostage Inc (BSTG) Overpaying Its CEO? – Simply Wall St News", "body": " Jim McGorry took the helm as Biostage Inc’s (NASDAQ:BSTG) CEO in 2015 and has earned $562,928 in total compensation over the past 12 months. An executive receiving a large part of compensation through stocks is considered more aligned with shareholder expectations of strong total returns — the reason behind a vast majority of S&P companies opting for performance-based stock grants with stock-based compensation accounting for nearly 60% of the overall payouts in 2015. Although BSTG is a small-cap company operating in United States, and may not be directly comparable to their larger counterparts, this analysis is still useful in terms of helping us understand how the company’s CEO is incentivised, and the level of alignment with shareholders.    Maximum CEO Comp = (0.5% * Net Income + 0.03% * Market Cap)  Executive compensation has been a controversial subject due to its historically non-transparent nature and the influence of executive management over the board, which is set up to uphold shareholders’ interests. Higher transparency resulting from new financial regulations have forced companies to disclose its executive remuneration structure in detail, offering investors some information around the appropriateness of this expense. Above is a simple equation that I use to judge whether BSTG’s CEO salary level is reasonable. After inputting BSTG’s variables into the equation, CEO compensation exceeds what I would expect to be a reasonable level. This is because BSTG delivered a negative income in the previous year, which makes any level of compensation above our benchmark. Generally, compared to CEO salaries of other small-cap companies, McGorry’s salary is above the appropriate level. BSTG must have a good reason to be paying its CEO a sum of $562,928. Or else shareholders may be bearing the brunt of the cost.   Although the company faced negative earnings in the past year, Biostage’s salary change remains relatively reasonable. Although CEO remuneration can be a useful sign for the alignment between a company’s CEO and its performance, it is certainly not sufficient to base your investment decision solely on this factor. Now that you know to keep in mind CEO compensation when putting together your investment thesis, I recommend you take a look at our latest free analysis report on Biostage to see BSTG’s fundamentals and whether it could be considered an undervalued opportunity.  PS. If you are not interested in Biostage anymore, you can use our free platform to see my list of over 50 other stocks with a high growth potential. "}, {"label": "spam", "published": "Thu, 07 Sep 2017 13:40:32 GMT", "url": "https://www.postanalyst.com/2017/09/07/could-today-be-a-major-turning-point-carbo-ceramics-inc-crr-biostage-inc-bstg/", "title": "Could Today Be A Major Turning Point? – CARBO Ceramics Inc. (CRR), Biostage, Inc. (BSTG) | Post Analyst", "body": "CARBO Ceramics Inc. (NYSE:CRR) recently ticked higher on weak volume. About 0.86 million contracts were traded on 06-Sep-17 compared to daily average volume of 0.97 million shares. The first sale was made at $6.82 but later the stock became weaker, and closed with a gain of 2.66%. It was last traded at $6.94 apiece.  CARBO Ceramics Inc. is maintained at an average hold rating by 9 stock analysts, and there are at least 54.96% of shares outstanding that are currently legally short sold. The shares went down by -3.61% in value last month. Year-to-date it plunged -33.65%. Analysts are turning out to be neutral than before, with 1 of analysts who cover CARBO Ceramics Inc. (NYSE:CRR) advice adding it to buy candidate list. Wall Street experts also assign a $8.75 price target on CARBO Ceramics Inc., pointing towards a 26.08% rally from current levels. The stock is trading for about -58.44% less than its 52-week high.  CARBO Ceramics Inc. (CRR) remained unsuccessful in beating the consensus-estimated -$0.86 as it actually earned -$0.93 per share in its last reported financial results. Revenue, on the other hand, scored 7.59% growth from the previous quarter, coming up with $37.3 million.   This company shares (CRR) so far managed to recover 22.61% since collapsing to its 52-week low. Over a month, it has seen its stock price volatility to stay at 5.6% while shortening the period to a week, volatility was 6.92%. The share price has already crossed its 20 days moving average, floating at a distance of 5.56% and sits 2.74% higher versus its 50 days moving average. When looking at the past five sessions, the stock returned 1.02% gains and is down by -26.13% compared with its 200-day moving average of $8.64. Also, CARBO Ceramics Inc. (CRR) needs to overturn a -43.3% decrease it experienced over the past twelve months.  As regular trading ended, Biostage, Inc. (BSTG) stock brought in a -$0.02 drop to $0.3. The day started at a price of $0.3278 but then traded as high as $0.3278 before giving part of the gains back. As for this week, analysts appear content to stick with their bleak outlook with the consensus call at 3. Biostage, Inc. is given 0 equivalent recommendations, 0 sells and 1 holds. The company shares sank -78.7% from their peak of $1.42 and now has a $11.63 million market value of equity.  The company had seen its current volume reaching at 1.8 million shares in the last trade. That compares with the recent volume average of 1.31 million. At the close of regular trading, its last week’s stock price volatility was 14.6% which for the month reaches 9.97%. Biostage, Inc. dipped to as low as $0.29 throughout the day and has returned -66.01% in this year. At one point in the past year, the shares traded as low as $0.2214 but has recovered 36.63% since then."}, {"label": "spam", "published": "Wed, 06 Sep 2017 13:48:00 GMT", "url": "https://economicsandmoney.com/2017/09/06/biostage-inc-bstg-vs-heat-biologics-inc-htbx-which-should-you-choose/", "title": "Biostage, Inc. (BSTG) vs. Heat Biologics, Inc. (HTBX)?: Which Should You Choose? – Economics and money", "body": "Biostage, Inc. (NASDAQ:BSTG) and Heat Biologics, Inc. (NASDAQ:HTBX) are both Healthcare companies that recently hit new highs. The recent price action of these companies has left many investors wondering what actions to take. To determine if one is a better investment than the other, we will compare the two names across various metrics, including growth, profitability, risk, return, dividends, and valuation. Biostage, Inc. (NASDAQ:BSTG) operates in the Biotechnology segment of the Healthcare sector. BSTG’s financial leverage ratio is 2.64, which indicates that the company’s asset base is primarily funded by debt. Company’s return on equity, which is really just the product of the company’s profit margin, asset turnover, and financial leverage ratios, is -591.20%, which is worse than the Biotechnology industry average ROE. Biostage, Inc. (BSTG) pays out an annual dividend per share. Stock’s free cash flow yield, which represents the amount of cash available to investors before dividends, expressed as a percentage of the stock price, is -28.13. All else equal, companies with higher FCF yields are viewed as cheaper. The average investment recommendation for BSTG, taken from a group of Wall Street Analysts, is 3.00, or a hold. Over the past three months, Biostage, Inc. insiders have been net sellers, acquiring a net of 250,000 shares. This implies that insiders have been feeling relatively bullish about the outlook for BSTG. Insider activity and sentiment signals are important to monitor because they can shed light on how “risky” a stock is perceived to be at it’s current valuation. Knowing this, it makes sense to look at beta, a measure of market risk. BSTG has a beta of 0.12 and therefore an below average level of market volatility. Heat Biologics, Inc. (NASDAQ:HTBX) operates in the Biotechnology segment of the Healthcare sector. HTBX has increased sales at a 12.70% CAGR over the past five years, and is considered a high growth stock. HTBX’s asset turnover ratio is 0.06 and the company has financial leverage of 0.77. Company is therefore mostly financed by equity capital. HTBX’s return on equity of -120.70% is worse than the Biotechnology industry average. The company trades at a free cash flow yield of -13.21. Compared to the average company in the 12.50 space. The average analyst recommendation for HTBX is 2.00, or a buy. Heat Biologics, Inc. insiders have sold a net of 0 shares during the past three months, which implies that the company’s top executives have been feeling bearish about the stock’s outlook. Finally, HTBX’s beta of 0.75 indicates that the stock has an below average level of market risk. Biostage, Inc. (NASDAQ:HTBX) scores higher than Heat Biologics, Inc. (NASDAQ:BSTG) on 5 of the 7 measures compared between the two companies. HTBX has the better fundamentals, scoring higher on efficiency, leverage and return metrics. Your email address will not be published. Required fields are marked * Economy and Money Authors gives investors their free and unbiased view of Financial Markets and on what happening in Stock Market. Our team certainly analyze tons of Stocks every day and provide their fair opinion on them. We are always looking over financial statements, company’s earning, analyst upgrades/downgrades, joint ventures and balance sheets to keep our reader up to date."}, {"label": "spam", "published": "Thu, 07 Sep 2017 09:11:10 GMT", "url": "http://stockdailyreview.com/trading-scope-following-signals-on-shares-of-biostage-bstg/", "title": "Trading Scope: Following Signals on Shares of Biostage (BSTG) – Stock Daily Review", "body": "Investors may be studying recent technical signals on shares of Biostage (BSTG). Watching the longer-term MACD oscillator indicator, we have seen that the signal is Buy. The MACD is typically used to measure bullish or bearish price movements. The direction of the MACD signal is currently Average. Taking a peek at the 50-day parabolic time/price signal, we can see the signal is presently displaying a Sell. Let’s take a quick look at some recent stock price activity. At the time of writing, the high price for the current session is 0.33. On the other end of the spectrum, the low price for the session is currently 0.29. After noting recent price levels, we can see that the change from today’s open is presently -0.02.Investors may be trying to identify volume trends over time. Some investors may look for consistency, while others may be interested in peculiar activity. Taking a look at some historical average volume numbers, Biostage (BSTG) has a 1 month average of 2176881, a 3 month average of 1324981. Focusing on another technical indicator, the stock currently has a 9 day raw stochastic value of 14.70%. This value (ranging from 0-100%) shows where the stock price closed relative to the price range over the given period.The current analyst rating on shares of Biostage (BSTG) is 3. This is based on a scale where a 5 would indicate a Strong Buy, a 4 would equal a Moderate Buy, 3 a hold, 2 a moderate sell, and a rating of 1 would indicate a Strong Sell. Investors often like to keep track of what the sell-side analysts think about certain stocks. Professional Street analysts that cover specific stocks may have deeper knowledge regarding the current health of the company. Analysts may be more active around earnings report periods. They will often make updates to estimates prior to and after a company’s quarterly release. Shifting gears, we can take a brief look at how the stock has fared over the past year. After a recent look, we have noted that the stock’s high price over the past 52-weeks is presently 1.42. Over the same period, shares have dipped to a low of 0.22. Investors and analysts will be curious to see how shares perform heading into the second half of the calendar year.Keeping tabs on some alternate data, we can see that the stock has a current weighted alpha of -30.78. The weighted alpha measures how much shares have increased or decreased over the full year time frame. The weighting assigns greater emphasis on more recent activity giving a more relevant measure for short-term technical analysts to use. A positive weighted alpha reading indicates that the stock has risen over the last year. A negative reading would indicate that the stock is down over that same time period. Technical traders often use the weighted alpha to help identify stocks that are building momentum. Investors may be studying recent technical signals on shares of Biostage (BSTG). Watching the longer-term MACD oscillator indicator, we have seen that the signal is Buy. The MACD is typically used to measure bullish or bearish price movements. The direction of the MACD signal is currently Average. Taking a peek at the 50-day parabolic time/price signal, we can see the signal is presently displaying a Sell. Let’s take a quick look at some recent stock price activity. At the time of writing, the high price for the current session is 0.33. On the other end of the spectrum, the low price for the session is currently 0.29. After noting recent price levels, we can see that the change from today’s open is presently -0.02. Investors may be trying to identify volume trends over time. Some investors may look for consistency, while others may be interested in peculiar activity. Taking a look at some historical average volume numbers, Biostage (BSTG) has a 1 month average of 2176881, a 3 month average of 1324981. Focusing on another technical indicator, the stock currently has a 9 day raw stochastic value of 14.70%. This value (ranging from 0-100%) shows where the stock price closed relative to the price range over the given period. The current analyst rating on shares of Biostage (BSTG) is 3. This is based on a scale where a 5 would indicate a Strong Buy, a 4 would equal a Moderate Buy, 3 a hold, 2 a moderate sell, and a rating of 1 would indicate a Strong Sell. Investors often like to keep track of what the sell-side analysts think about certain stocks. Professional Street analysts that cover specific stocks may have deeper knowledge regarding the current health of the company. Analysts may be more active around earnings report periods. They will often make updates to estimates prior to and after a company’s quarterly release. Shifting gears, we can take a brief look at how the stock has fared over the past year. After a recent look, we have noted that the stock’s high price over the past 52-weeks is presently 1.42. Over the same period, shares have dipped to a low of 0.22. Investors and analysts will be curious to see how shares perform heading into the second half of the calendar year. Keeping tabs on some alternate data, we can see that the stock has a current weighted alpha of -30.78. The weighted alpha measures how much shares have increased or decreased over the full year time frame. The weighting assigns greater emphasis on more recent activity giving a more relevant measure for short-term technical analysts to use. A positive weighted alpha reading indicates that the stock has risen over the last year. A negative reading would indicate that the stock is down over that same time period. Technical traders often use the weighted alpha to help identify stocks that are building momentum. Your email address will not be published."}]